app/controllers/posts_controller.rb

  def find_post
    @post = Post.find(params[:post])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]